//------------------------------------------------------------------------------
//
// file name：wfrecord.cs
// author: peidun
// create date：2009-11-18 16:47:02
//
//------------------------------------------------------------------------------
using System;
namespace Book.Model
{
	/// <summary>
	/// 1、工作流审批整体状态:
   //  表示携带数据的当前执行的工作流的最后状态是通过了还是,由于资料,条件的不足导致审批未通过.
   //     进行中----------0(default)
   //     通过审批--------1
   //     未通过审批------2
   //2,待处理标志:定义被启动的该工作流执行记录的目前状态,根据实际情况可分为以下几种
   //a准备阶段----0(default)
   //b进行阶段----1
   //c停止--------2
   //d结束--------3
   //e作废--------4
   
   
	/// </summary>
	[Serializable]
	public partial class wfrecord
	{

	}
}
